based
author
booktitle
doi
editor
isbn
issn
journal
keywords
month
note
number
pages
publisher
series
title
url
volume
year
a
abacus
abstract
abstracts
according
acm
acmid
action
adam
added
adding
addison
address
advanced
affordance
affordances
agarawala
aid
aided
alternatives
amant
american
amsterdam
an
analytics
anand
and
angelo
animal
anne
annelie
annual
anti
antonio
aoki
apes
approach
april
archives
archiving
are
arnell
around
article
artifacts
as
asian
associates
at
atsushi
attention
attributes
aug
australia
author
axes
b
baber
back
backward
balakrishnan
baldwin
ball
bard
based
be
behave
behavior
behaviour
believe
ben
benefits
berkeley
berlin
bibliography
bibsonomy
bibtex
biburl
bier
bimanual
biological
bjork
body
bongshin
book
books
books?id
booktitle
bouwhuis
bradford
breakdowns
brian
bridges
browsing
bubble
budapest
building
bumptop
buttons
by
c
ca
cag
california
called
cambridge
can
canada
carroll
casually
categorical
catherine
cavedon
cfm?id
changing
chapter
character
characteristics
characterizing
chi
chia
chris
citation
citeulike
clifton
cloud
clouds
clues
clustering
co
cognition
cognitive
coherently
collections
com
commun
comparative
comput
computer
computing
conference
consider
considerations
course
creation
creativity
crossref
cs
cues
cugini
cutrell
czerwinski
d
dahlback
daniel
dantzich
danyel
darken
data
date
david
db
dblp
de
deborah
definition
dennis
denver
description
design
designing
desktop
desktops
desney
determination
developed
development
dialogue
digital
dimensionality
direct
display
display;female;humans;information
displays
displays;computer
displays;data
displays;monitoring;multidimensional
dkaki
dl
document
doi
don
donald
douglas
dragged
drawing
dret
dwyer
dx
e
ea
ecdl
ecological
edition
editor
edu
edward
ee
effective
effects
elmsford
elsevier
embodied
engagement
engine
environment
ergonomics
eric
erik
erlbaum
etc
european
evaluation
evaluation;large
evolution
examples
explicit
explorative
explore
extended
f
factors
falk
feldman
ferre
fifth
file
filing
fischer
fisher
foo
for
forging
forlines
forms
fox
france
francis
francisco
friction
frontiers
fundamental
g
gary
gatherer
gathering
gaver
gender
gentner
george
gerhard
gestalt
gestural
gestures;
gibson
good
google
graph
graphical
graphics
graphics;data
grau
great
greg
grinter
gross
guidelines
gulliksen
handles
hanoi
harvard
has
have
hawaii
hawthorne
heath
heidelberg
hendry
hierarchical
hierarchy
hieraxes
hillsdale
hirschberg
his
hix
holland
honeybrown
honolulu
horton
houghton
http
huang
hum
human
hungary
hunter
hutchins
icadl
icon
id
ieee
immediate
implications
import
imported
in
inc
include
incollection
index
indicate
inevitably
influenced
influential
information
infotouch
ingmanson
ingold
inkpen
inproceedings
input
instead
institutions;encoding;humans;large
int
integrates
interact
interaction
interactions
interactive
interface
interface;visual
interfaces
interhash
international
into
intrahash
introduction
invited
iriki
isbn
isenberg
issn
issue_date
it
j
jakob
james
jan
jcdl
jeanine
jeffries
jerome
joackim
joanna
johan
john
joint
jose
josiane
journal
journals
jul
julia
july
jun
june
justin
k
karimi
kbs
kca
keepin
kevin
keywords
kinesthesis
kinesthetic
knobs
knowl
kori
kotzé
kristensson
l
language
large
lars
larson
laskowski
lawrence
lccn
leads
lecture
lee
lenth
lenwood
levers
lib
libraries
library
lightweight
like
ling
location
looking
louisiana
lucy
lund
m
maarten
mac
makes
making
management
mangement
manipulate
manipulation
manner
map
maps
maravita
marc
march
marco
martinez
mary
mass
melbourne
memory
metadata
metaphor
metaphors
meyers
mice
michael
mifflin
miller
minds
minneapolis
minnesota
misc
mit
modelling
modern
modjeska
month
montreal
more
mothe
mountain
mouse
much
multi
multidimensional
multimodal
multiple
n
navigating
ncsu
neel
netherlands
new
newman
niclas
nielsen
nils
nj
no
nordic
nordichi
norman
north
note
notes
nowell
number
numpages
ny
objects
october
oestreicher
of
ola
olof
olson
on
opportunities
optimized
or
org
organization
organizational
orleans
p
page
pages
palanque
pan
paniscus
paper
parker
paul
paula
pausch
pdf
pearson
pen
pennerup
per
perceived
perception
perceptual
perer
performance;reaction
pergamon
personal
petra
phbaer
philippe
photo
physical
physically
physics
pii
piles
piling
plaisant
planning
positional
possibilities
posted
practical
prates
present
press
primates
priority
proc
proceedings
processing
productivity
proffitt
prototype
prox
prytz
psychologist
psychology
publisher
publishers
pubs
pulling
pushing
query
quinn
r
randy
raqueloliveira
ravin
reaching
reading
real
realistic
realizing
rebecca
reduction
reformulation
regan
representation
research
result
results
retrieval
retrieval;male;psychomotor
revisiting
robbins
robert
robertson
robin
rodden
rose
rudolph
russell
russon
s
sample
san
sarvnaz
scalability
scale
schema
scholer
schraefel
schubert
science
sciencedirect
sciences
screen
search
searching
sebrechts
semant
sensory
sep
sept
september
series
sharon
shen
shengdong
shneiderman
sibert
sigchi
sigir
similarity
simulation
size
sliding
smart
smartgraph
smith
social
software
some
space
spaces
spatial
springer
st
starkweather
stefanucci
step
steve
storage
strategies
strom
structure
style
such
sue
suite
support
surface
surface;
surfaces
sweden
switzerland
symposium
syst
systems
systems;scalability;information
t
tabletop
tag
tagged
tagging
tags
tan
taoufiq
taylor
techniques
technology
terry
texas
text
that
the
theories
theory
theory;computer
thiel
this
thomas
thought;
through
tics
tile
tim
time;user
timestamp
timothy
title
to
tom
tool
tools
topic
tossed
touch
touch;
touchscreen
toward
trans
transactions
transclusions
tree
trends
trier
turning
tvcg
uist
understanding
uni
university
upon
uri
url
usa
usability
use
user
using
v
value
van
variety
various
vasilakis
vauclair
verlag
very
vietnam
view
virtual
visual
visualisation
visualization
visualization;educational
visualization;empirical
visualizing
volume
vr
vs
w
was
way
we
web
websem
wesley
whittaker
wide
wigdor
wikman
wild
william
winckler
with
within
world
would
www
x
xavier
year
years
york
yost
yuxiang
zhao
zhu
zobel
zurich
